IRP/src/Catalogs/LockDataModificationReasons/LockDataModificationReasons.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>LockDataModificationReasons</name>
 <attributes>
  <name>ForAllUsers</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DisableRule</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SetOneRuleForAllObjects</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Attribute</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ComparisonType</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Value</name>
  <type>
   <types>Boolean</types>
   <types>String</types>
   <types>Date</types>
   <types>Number</types>
   <types>AnyRef</types>
   <numberQualifiers>
    <precision>10</precision>
    <scale>5</scale>
   </numberQualifiers>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SetValueAsCode</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AdvancedMode</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DCS</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>QueryFilter</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>isInitDCS</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PreviewText</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckIsObjectLockedOnOpen</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RuleList</name>
  <attributes>
   <name>Type</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>256</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>64</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ComparisonType</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>AnyRef</types>
    <numberQualifiers>
     <precision>10</precision>
     <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>DisableRule</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>TableName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>SetValueAsCode</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>UserList</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AccessGroupList</name>
  <attributes>
   <name>AccessGroup</name>
   <type>
    <types>CatalogRef.AccessGroups</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ResponsibleUsers</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/LockDataModificationReuse/Module.bsl
// @strict-types

// Get DSCTemplate.
// 
// Parameters:
//  MetadataName - String - Metadata name
//  Rule - CatalogRef.LockDataModificationReasons - Rule
// 
// Returns:
//  DataCompositionTemplate - Get DSCTemplate
Function GetDSCTemplate(Val MetadataName, Rule) Export
	DCSTemplate = Catalogs.LockDataModificationReasons.GetTemplate("DCS");
	DataSources = DCSTemplate.DataSources.Add();
	DataSources.DataSourceType = "Local";
	DataSources.Name = "DataSource";
	
	Query = 
	"SELECT 
	|	*
	|FROM
	|    " + MetadataName + " AS DataSet";
	DataSet = DCSTemplate.DataSets.Add(Type("DataCompositionSchemaDataSetQuery"));
	DataSet.Query = Query;
	DataSet.Name = MetadataName;
	DataSet.DataSource = DataSources.Name;
	
	Settings = Rule.DCS.Get(); // DataCompositionSettings
	Composer = New DataCompositionTemplateComposer();
	Template = Composer.Execute(DCSTemplate, Settings, , , Type("DataCompositionValueCollectionTemplateGenerator"));
	Return Template
EndFunction
